package api.model;

/**
 * Created by yangshiyou on 2017/11/7.
 */

public class ChapterInfo {


    /**
     * status : 1
     * msg :
     * islock : 2
     * aid : 1691
     * cid : 20141
     * previous : 20059
     * next : 20143
     * articlename : 盗贼求生计
     * chaptertype : 0
     * chaptername : 第四章 得手
     * authorid : null
     * author : null
     * isvip : 0
     * ismy : null
     * saleprice : 0
     * postdate : 20160313205030
     * lastupdate : 20160313205030
     * words : 2021
     * summary :     索罗门街没有黑夜，被晶石灯点缀的街道闪烁着比白天更夺目的光彩，各色人流在其中穿行，不同种族，不同身份，他们有各种宗教信仰和奇异嗜好。在这里你可以见到旧帝国的王公贵族（他们很好辨认，无论一年四季都穿着带有盘花扣的紧身丝衣）你也可以见到神秘的吉萨人，无论男女都披着兽皮，带着野兽面具。
     * <p>
     * 你有时可以在街上看到一群剃着光头，身穿红色拖地长衫，画着黑色眼影的怪男人们，他们是西亚细亚的安多来使同时也是藏红花的供应商，了解他们的商人这时会殷勤地送去一匹白马，这可是比任何一个送美女的都强。无他，因为在..
     * summoryhtml : &nbsp;&nbsp;&nbsp;&nbsp;索罗门街没有黑夜，被晶石灯点缀的街道闪烁着比白天更夺目的光彩，各色人流在其中穿行，不同种族，不同身份，他们有各种宗教信仰和奇异嗜好。在这里你可以见到旧帝国的王公贵族（他们很好辨认，无论一年四季都穿着带有盘花扣的紧身丝衣）你也可以见到神秘的吉萨人，无论男女都披着兽皮，带着野兽面具。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;你有时可以在街上看到一群剃着光头，身穿红色拖地长衫，画着黑色眼影的怪男人们，他们是西亚细亚的安多来使同时也是藏红花的供应商，了解他们的商人这时会殷勤地送去一匹白马，这可是比任何一个送美女的都强。无他，因为在..
     * contenthtml : &nbsp;&nbsp;&nbsp;&nbsp;索罗门街没有黑夜，被晶石灯点缀的街道闪烁着比白天更夺目的光彩，各色人流在其中穿行，不同种族，不同身份，他们有各种宗教信仰和奇异嗜好。在这里你可以见到旧帝国的王公贵族（他们很好辨认，无论一年四季都穿着带有盘花扣的紧身丝衣）你也可以见到神秘的吉萨人，无论男女都披着兽皮，带着野兽面具。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;你有时可以在街上看到一群剃着光头，身穿红色拖地长衫，画着黑色眼影的怪男人们，他们是西亚细亚的安多来使同时也是藏红花的供应商，了解他们的商人这时会殷勤地送去一匹白马，这可是比任何一个送美女的都强。无他，因为在安多人的习俗里，白马代表神的祝福。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;当然如果你运气太好，说不定还能撞见少有的食人族，血眸黑发，白色纹身，请不要被名字吓到，他们只分食亲朋好友的尸体，哦，有时还有敌人的。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;因此在索罗门街上，无论你如何打扮都不会引人注意，没有怪的，只有更怪的。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;此时，薇儿正踩着无声的脚步走在索罗门街上，黑色的齐耳短发映衬着雪白的肌肤，一双紫色的眼睛更是一潭深水不时地闪烁着什么，不过他正皱着眉头，心里面也是一阵阵的火烧。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;那个该死的老头，薇儿握着拳，眼里放着火，路过街边的垃圾桶时，更是一阵踹，引得路人纷纷识趣地绕道走开。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;平时没事就找上门唠叨的臭老头，这次我主动提出要求合作不但回绝我还躲得让我好找！还有那个无赖的女强盗，什么时候跑去和老头同住了？！还假惺惺地在我面前装，说什么人家是一起出任务的~~我靠！一起出任务还需要瞒着我搬去住到那个‘老回路’他家楼上？真是会躲！不是我亲自找上门，还会一直被蒙在鼓里呢！<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;薇儿越想越火大，同时还夹杂着浓浓的嫉妒，特别是想到女强盗那波澜起伏的身材，薇儿就一阵咬牙切齿。真是的！我哪里比那个老头差了！心里一阵吼，脸色更是阴郁地要滴出水来。直到拐过最后一个弯，薇儿轻巧地闪入墙壁的阴影中，顺着砖墙走了十多步，一低身，钻进了半人高的下水道入口，然后轻车熟路地七弯八拐，爬上一段阶梯，最后来到了一个铁栏封着的水道口前。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;带上手套，仔细地转动几根铁栏杆，轻易地就卸了下来放到一边，原来这些早就被切断了，只是装在上面摆样子。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;薇儿深深地换了几口气，调整了下心情，摸了摸之前从老头那边强借来的晶石装置，有了这个今天就可以拿到手了，绝不能出什么差错。其实要不是老头躲着我不愿合作，也不用拖那么长时间…用不到四十天的时间，调查这个浑身带着晶石，没有固定习惯的索索，还要查到卷轴的收藏之处，以及摸清各种隐秘的保护装置和机关，甚至为了让那只传说中的犬魔大意，还特地买通了祭司院的花匠，种了一院子的薄荷叶，着实花了一番功夫。至于那瓶墨绿色的药水，哼，我薇儿从来不会喝那种来历不明的东西。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;在重新检查了一遍身上的装备后，薇儿缓慢地掀开了头顶上的地砖，悄无声息的一个单手引体向上翻了上去。这里正是祭司院后花园的水池边，随手捻起几根薄荷叶掩盖掉自己的味道，猫着腰沿着阴影一路快速移动，来到花园的铁门前。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;伸手透过雕花栏杆摸着从墙根向上数到倒数第七块转头，轻轻一推便现出一个暗格，里面放着的正是花园的备用钥匙！打开了花园的小铁门，薇儿便顺利地从花园进到大厅，又畅通无阻的摸到祭司院的冥想室，一路或卸或避地处理一系列的晶石感应装置，最后顺着暗梯来到了卷轴的收藏格，打开这个收藏格需要有索索的批准印章以及标准的中级符文做引导才能开启。印章的话已经派人掉包了索索的批示文件，而中级符文就需要这个从老头那里要来的模拟装置了，这是根据晶石回路引导的符文转化装置，比起真人的咏唱不但需要耗费更高级的晶石而且花费的时间也更久。这是当初器械师们为了能够提高晶石能量转化率而研究的产品——模拟符文的形式发动晶石——结果是毫无悬念的失败了。而这个装置自然也成了废品被甩到回收站当废铜烂铁卖，然后被老猫慧眼识货地以十个铜币买下了。这个虽然在器械师眼中是废品，但在盗贼们的眼中却是无价之宝——很多有价值的东西都会使用特定符文来做保护，而要解开它们要么使用特别的门语，要么就得从符文下手。毕竟会符文的人不必当盗贼，而当盗贼的多数没有天赋发动符文。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;薇儿迅速地从怀里掏出从批示文件上抠下来的印章图案，对准了暗格上的晶石，然后左手扣动转化装置。在一阵微亮的光芒过后，刻在收藏格四周的符文被逐个点亮了起来，直到被点亮的符文终于构成了闪亮的一圈，轻微的咔哒一声，收藏格的挡板自动地下滑，露出了里面一堆的卷轴和各色晶石。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;薇儿的字典里面从没有“知足”这个词，这跟娼妇遇到帅哥是一个道理——哪有不上前调戏的…但同时，薇儿也还明白一个道理“过犹不及”，拿多了也会惹麻烦。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;于是迅速地取完目标物品后，又随手抓了几个成色中等的晶石，合上挡板，收拾走人！一路边往回溜边把感应装置和暗道还原，关上花园的铁门，钥匙回归原位，滑下地道，盖上石板。一切都行云流水，花了还不到一根烟的时间。<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;完成了任务的薇儿明显开心了点，一路快步钻出了下水道，然后还特地去香水店转了一圈去掉身上的薄荷味，这下再灵敏的鼻子也探不到我了吧~<br />
     * <br />
     * &nbsp;&nbsp;&nbsp;&nbsp;接下去只要等待雇主来取货便是了…
     * content :     索罗门街没有黑夜，被晶石灯点缀的街道闪烁着比白天更夺目的光彩，各色人流在其中穿行，不同种族，不同身份，他们有各种宗教信仰和奇异嗜好。在这里你可以见到旧帝国的王公贵族（他们很好辨认，无论一年四季都穿着带有盘花扣的紧身丝衣）你也可以见到神秘的吉萨人，无论男女都披着兽皮，带着野兽面具。
     * <p>
     * 你有时可以在街上看到一群剃着光头，身穿红色拖地长衫，画着黑色眼影的怪男人们，他们是西亚细亚的安多来使同时也是藏红花的供应商，了解他们的商人这时会殷勤地送去一匹白马，这可是比任何一个送美女的都强。无他，因为在安多人的习俗里，白马代表神的祝福。
     * <p>
     * 当然如果你运气太好，说不定还能撞见少有的食人族，血眸黑发，白色纹身，请不要被名字吓到，他们只分食亲朋好友的尸体，哦，有时还有敌人的。
     * <p>
     * 因此在索罗门街上，无论你如何打扮都不会引人注意，没有怪的，只有更怪的。
     * <p>
     * 此时，薇儿正踩着无声的脚步走在索罗门街上，黑色的齐耳短发映衬着雪白的肌肤，一双紫色的眼睛更是一潭深水不时地闪烁着什么，不过他正皱着眉头，心里面也是一阵阵的火烧。
     * <p>
     * 那个该死的老头，薇儿握着拳，眼里放着火，路过街边的垃圾桶时，更是一阵踹，引得路人纷纷识趣地绕道走开。
     * <p>
     * 平时没事就找上门唠叨的臭老头，这次我主动提出要求合作不但回绝我还躲得让我好找！还有那个无赖的女强盗，什么时候跑去和老头同住了？！还假惺惺地在我面前装，说什么人家是一起出任务的~~我靠！一起出任务还需要瞒着我搬去住到那个‘老回路’他家楼上？真是会躲！不是我亲自找上门，还会一直被蒙在鼓里呢！
     * <p>
     * 薇儿越想越火大，同时还夹杂着浓浓的嫉妒，特别是想到女强盗那波澜起伏的身材，薇儿就一阵咬牙切齿。真是的！我哪里比那个老头差了！心里一阵吼，脸色更是阴郁地要滴出水来。直到拐过最后一个弯，薇儿轻巧地闪入墙壁的阴影中，顺着砖墙走了十多步，一低身，钻进了半人高的下水道入口，然后轻车熟路地七弯八拐，爬上一段阶梯，最后来到了一个铁栏封着的水道口前。
     * <p>
     * 带上手套，仔细地转动几根铁栏杆，轻易地就卸了下来放到一边，原来这些早就被切断了，只是装在上面摆样子。
     * <p>
     * 薇儿深深地换了几口气，调整了下心情，摸了摸之前从老头那边强借来的晶石装置，有了这个今天就可以拿到手了，绝不能出什么差错。其实要不是老头躲着我不愿合作，也不用拖那么长时间…用不到四十天的时间，调查这个浑身带着晶石，没有固定习惯的索索，还要查到卷轴的收藏之处，以及摸清各种隐秘的保护装置和机关，甚至为了让那只传说中的犬魔大意，还特地买通了祭司院的花匠，种了一院子的薄荷叶，着实花了一番功夫。至于那瓶墨绿色的药水，哼，我薇儿从来不会喝那种来历不明的东西。
     * <p>
     * 在重新检查了一遍身上的装备后，薇儿缓慢地掀开了头顶上的地砖，悄无声息的一个单手引体向上翻了上去。这里正是祭司院后花园的水池边，随手捻起几根薄荷叶掩盖掉自己的味道，猫着腰沿着阴影一路快速移动，来到花园的铁门前。
     * <p>
     * 伸手透过雕花栏杆摸着从墙根向上数到倒数第七块转头，轻轻一推便现出一个暗格，里面放着的正是花园的备用钥匙！打开了花园的小铁门，薇儿便顺利地从花园进到大厅，又畅通无阻的摸到祭司院的冥想室，一路或卸或避地处理一系列的晶石感应装置，最后顺着暗梯来到了卷轴的收藏格，打开这个收藏格需要有索索的批准印章以及标准的中级符文做引导才能开启。印章的话已经派人掉包了索索的批示文件，而中级符文就需要这个从老头那里要来的模拟装置了，这是根据晶石回路引导的符文转化装置，比起真人的咏唱不但需要耗费更高级的晶石而且花费的时间也更久。这是当初器械师们为了能够提高晶石能量转化率而研究的产品——模拟符文的形式发动晶石——结果是毫无悬念的失败了。而这个装置自然也成了废品被甩到回收站当废铜烂铁卖，然后被老猫慧眼识货地以十个铜币买下了。这个虽然在器械师眼中是废品，但在盗贼们的眼中却是无价之宝——很多有价值的东西都会使用特定符文来做保护，而要解开它们要么使用特别的门语，要么就得从符文下手。毕竟会符文的人不必当盗贼，而当盗贼的多数没有天赋发动符文。
     * <p>
     * 薇儿迅速地从怀里掏出从批示文件上抠下来的印章图案，对准了暗格上的晶石，然后左手扣动转化装置。在一阵微亮的光芒过后，刻在收藏格四周的符文被逐个点亮了起来，直到被点亮的符文终于构成了闪亮的一圈，轻微的咔哒一声，收藏格的挡板自动地下滑，露出了里面一堆的卷轴和各色晶石。
     * <p>
     * 薇儿的字典里面从没有“知足”这个词，这跟娼妇遇到帅哥是一个道理——哪有不上前调戏的…但同时，薇儿也还明白一个道理“过犹不及”，拿多了也会惹麻烦。
     * <p>
     * 于是迅速地取完目标物品后，又随手抓了几个成色中等的晶石，合上挡板，收拾走人！一路边往回溜边把感应装置和暗道还原，关上花园的铁门，钥匙回归原位，滑下地道，盖上石板。一切都行云流水，花了还不到一根烟的时间。
     * <p>
     * 完成了任务的薇儿明显开心了点，一路快步钻出了下水道，然后还特地去香水店转了一圈去掉身上的薄荷味，这下再灵敏的鼻子也探不到我了吧~
     * <p>
     * 接下去只要等待雇主来取货便是了…
     * notice :
     * picurl : ["http://xxxx.uuu1","http://xxxx.uuu2"]
     */

    private int status;
    private String msg;
    private int aid;
    private int cid;
    private int previous;
    private int next;
    private int chaptertype;
    private String articlename;
    private String chaptername;
    private String content;


    public int getStatus() {
        return status;
    }

    public void setStatus(int status) {
        this.status = status;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public int getAid() {
        return aid;
    }

    public void setAid(int aid) {
        this.aid = aid;
    }

    public int getCid() {
        return cid;
    }

    public void setCid(int cid) {
        this.cid = cid;
    }

    public int getPrevious() {
        return previous;
    }

    public void setPrevious(int previous) {
        this.previous = previous;
    }

    public int getNext() {
        return next;
    }

    public void setNext(int next) {
        this.next = next;
    }

    public int getChaptertype() {
        return chaptertype;
    }

    public void setChaptertype(int chaptertype) {
        this.chaptertype = chaptertype;
    }

    public String getArticlename() {
        return articlename;
    }

    public void setArticlename(String articlename) {
        this.articlename = articlename;
    }

    public String getChaptername() {
        return chaptername;
    }

    public void setChaptername(String chaptername) {
        this.chaptername = chaptername;
    }

    public String getContent() {
        return content;
    }

    public void setContent(String content) {
        this.content = content;
    }
}
